In [7]:
import pandas as pd
data = {
    "Name": ['Ram', None, 'Ghanshyam', None, 'Aditi', 'Jagdish', 'Raj', 'Simran'],
    "Age": [28, None, 22, 30, 29, 40, 25, 32],
    "Salary": [50000, None, 45000, 52000, 49000, 70000, 48000, 58000],
    "Performance_Score": [85, None, 78, 92, 88, 95, 80, 89]
}
df = pd.DataFrame(data)

In [8]:
df

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1        NaN   NaN      NaN                NaN
2  Ghanshyam  22.0  45000.0               78.0
3        NaN  30.0  52000.0               92.0
4      Aditi  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0

In [9]:
df.isnull().sum()

Name                 2
Age                  1
Salary               1
Performance_Score    1
dtype: int64

In [10]:
df.dropna()

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
2  Ghanshyam  22.0  45000.0               78.0
4      Aditi  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0

In [14]:
df.dropna(axis=0)

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
2  Ghanshyam  22.0  45000.0               78.0
4      Aditi  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0

In [15]:
df.fillna(0)

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1          0   0.0      0.0                0.0
2  Ghanshyam  22.0  45000.0               78.0
3          0  30.0  52000.0               92.0
4      Aditi  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0

In [21]:
df['Age'].fillna(df['Age'].mean())

0    28.000000
1    29.428571
2    22.000000
3    30.000000
4    29.000000
5    40.000000
6    25.000000
7    32.000000
Name: Age, dtype: float64

In [22]:
df

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1        NaN   NaN      NaN                NaN
2  Ghanshyam  22.0  45000.0               78.0
3        NaN  30.0  52000.0               92.0
4      Aditi  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0

In [30]:
import pandas as pd
df = pd.DataFrame({'Data': [1, 500, None, 1300, 100]})

# Linear interpolation (default)
df['Interpolated'] = df['Data'].interpolate(method='linear')

In [31]:
df

     Data  Interpolated
0     1.0           1.0
1   500.0         500.0
2     NaN         900.0
3  1300.0        1300.0
4   100.0         100.0

In [49]:
import pandas as pd
data = {
    "Name": ['Ram', 'Ghanshyam', None, 'Aditi',None, 'Jagdish', 'Raj', 'Simran'],
    "Age": [28, 32, 22, 30, 29, 40, 25, 32],
    "Salary": [50000, None, 45000, 52000, 49000, 70000, 48000, 58000],
    "Performance_Score": [85, None, 78, 92, 88, 95, 80, 89]
}
df = pd.DataFrame(data)
df.dropna(inplace=True)

In [42]:
df.sort_values(by='Name',ascending=False)

      Name   Age   Salary  Performance_Score
7   Simran  32.0  58000.0               89.0
0      Ram  28.0  50000.0               85.0
6      Raj  25.0  48000.0               80.0
5  Jagdish  40.0  70000.0               95.0
3    Aditi  30.0  52000.0               92.0

In [45]:
df.sort_values(by=['Name','Salary'],ascending=[True,False])

      Name   Age   Salary  Performance_Score
3    Aditi  30.0  52000.0               92.0
5  Jagdish  40.0  70000.0               95.0
6      Raj  25.0  48000.0               80.0
0      Ram  28.0  50000.0               85.0
7   Simran  32.0  58000.0               89.0

In [52]:
df.groupby('Age')['Salary'].sum()

Age
25    48000.0
28    50000.0
30    52000.0
32    58000.0
40    70000.0
Name: Salary, dtype: float64

In [54]:
df.groupby(['Age','Name'])['Salary'].sum()

Age  Name
25   Raj        48000.0
28   Ram        50000.0
30   Aditi      52000.0
32   Simran     58000.0
40   Jagdish    70000.0
Name: Salary, dtype: float64

In [56]:
import pandas as pd

# Create example DataFrames
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value1': [1, 2, 3, 5]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D', 'E'], 'value2': [4, 5, 6, 7]})

# Perform an inner merge (default) on the 'key' column
merged_df_inner = pd.merge(df1, df2, on='key', how='inner')
print("Inner Merge:")
print(merged_df_inner)

# Perform an outer merge
merged_df_outer = pd.merge(df1, df2, on='key', how='outer')
print("\nOuter Merge:")
print(merged_df_outer)

Inner Merge:

Outer Merge:
  key  value1  value2
0   A     1.0     NaN
1   B     2.0     4.0
2   C     3.0     5.0
3   D     5.0     6.0
4   E     NaN     7.0